class DataModel:
    def create_client_storage(self, page):
        if not hasattr(page, "client_storage"):
            page.client_storage.set("phName", [])

    def __init__(self):
        self.phName = []

    def load_data(self, page):
        # ストレージがなければ作成する
        DataModel.create_client_storage(self, page)
        phNameList = page.client_storage.get("phName")
        if phNameList == None:
            phNameList = []
        self.phName = phNameList
        return phNameList

    def times(self):
        return [
            "8:30 8:45",
            "8:45 9:00",
            "9:00 9:15",
            "9:15 9:30",
            "9:30 9:45",
            "9:45 10:00",
            "10:00 10:15",
            "10:15 10:30",
            "10:30 10:45",
            "10:45 11:00",
            "11:00 11:15",
            "11:15 11:30",
            "11:30 11:45",
            "11:45 12:00",
            "12:00 12:15",
            "12:15 12:30",
            "12:30 12:45",
            "12:45 13:00",
            "13:00 13:15",
            "13:15 13:30",
            "13:30 13:45",
            "13:45 14:00",
            "14:00 14:15",
            "14:15 14:30",
            "14:30 14:45",
            "14:45 15:00",
            "15:00 15:15",
            "15:15 15:30",
            "15:30 15:45",
            "15:45 16:00",
            "16:00 16:15",
            "16:15 16:30",
            "16:30 16:45",
            "16:45 17:00",
            "17:00 17:15",
            "17:15 17:30",
            "17:30 17:45",
            "17:45 18:00",
            "18:00 18:15",
            "18:15 18:30",
            "18:30 18:45",
            "18:45 19:00",
            "19:00 19:15",
            "19:15 19:30",
            "19:30 19:45",
            "19:45 20:00",
            "20:00 20:15",
            "20:15 20:30",
            "20:30 20:45",
            "20:45 21:00",
            "21:00 21:15",
            "21:15 21:30",
            "21:30 21:45",
            "21:45 22:00",
            "22:00 22:15",
            "22:15 22:30",
        ]

    def time_for_visual(self):
        return [
            "8:30",
            "8:45",
            "9:00",
            "9:15",
            "9:30",
            "9:45",
            "10:00",
            "10:15",
            "10:30",
            "10:45",
            "11:00",
            "11:15",
            "11:30",
            "11:45",
            "12:00",
            "12:15",
            "12:30",
            "12:45",
            "13:00",
            "13:15",
            "13:30",
            "13:45",
            "14:00",
            "14:15",
            "14:30",
            "14:45",
            "15:00",
            "15:15",
            "15:30",
            "15:45",
            "16:00",
            "16:15",
            "16:30",
            "16:45",
            "17:00",
            "17:15",
            "17:30",
            "17:45",
            "18:00",
            "18:15",
            "18:30",
            "18:45",
            "19:00",
            "19:15",
            "19:30",
            "19:45",
            "20:00",
            "20:15",
            "20:30",
            "20:45",
            "21:00",
            "21:15",
            "21:30",
            "21:45",
            "22:00",
            "22:15",
            "22:30",
        ]

    def amTime(self):
        return [
            "8:30 8:45",
            "8:45 9:00",
            "9:00 9:15",
            "9:15 9:30",
            "9:30 9:45",
            "9:45 10:00",
            "10:00 10:15",
            "10:15 10:30",
            "10:30 10:45",
            "10:45 11:00",
            "11:00 11:15",
            "11:15 11:30",
            "11:30 11:45",
            "11:45 12:00",
            "12:00 12:15",
            "12:15 12:30",
        ]

    def pmTime(self):
        return [
            "12:30 12:45",
            "12:45 13:00",
            "13:00 13:15",
            "13:15 13:30",
            "13:30 13:45",
            "13:45 14:00",
            "14:00 14:15",
            "14:15 14:30",
            "14:30 14:45",
            "14:45 15:00",
            "15:00 15:15",
            "15:15 15:30",
            "15:30 15:45",
            "15:45 16:00",
            "16:00 16:15",
            "16:15 16:30",
            "16:30 16:45",
            "16:45 17:00",
            "17:00 17:15",
            "17:15 17:30",
            "17:30 17:45",
            "17:45 18:00",
            "18:00 18:15",
            "18:15 18:30",
            "18:30 18:45",
            "18:45 19:00",
            "19:00 19:15",
            "19:15 19:30",
            "19:30 19:45",
            "19:45 20:00",
            "20:00 20:15",
            "20:15 20:30",
            "20:30 20:45",
            "20:45 21:00",
            "21:00 21:15",
            "21:15 21:30",
            "21:30 21:45",
            "21:45 22:00",
            "22:00 22:15",
            "22:15 22:30",
        ]

    def draggable_data(self):
        return {
            "0":{"task": "初回・中間指導情報収集","info":"初回・中間指導情報収集に関する情報、手帳・持参薬の移動確認"},  # 0
            "1":{"task": "退院指導情報収集","info":"退院時準備含む"},  # 1
            "2":{"task": "注射台車監査","info":"注射台車監査のみをカウントすることとする"},  # 2
            "3":{"task": "服薬指導","info":""},#3
            "4":{"task": "指導記録作成","info":"記録を作成したものは全てカウントする"},#4
            "5":{"task": "無菌調製(調製者)","info":""},  # 5
            "6":{"task": "無菌調製補助業務（準備、監査）","info":"混注準備と監査を含む"},  # 6
            "7":{"task": "薬剤セット","info":"5D定期のセット"},  # 7
            "8":{"task": "薬剤セット確認","info":"定期セット薬の確認"},  # 8
            "9":{"task": "持参薬を確認","info":"最初に入力する方は件数を入れ、ダブルチェックする方は件数を入れない（時間はどちらも入力するs）"},  # 9
            "10":{"task": "薬剤服用歴等について保険薬局へ照会","info":""},  # 10
            "11":{"task": "薬剤サマリー作成","info":""},  # 11
            "12":{"task": "処方代理修正・代行入力","info":""},  # 12
            "13":{"task": "TDM実施","info":"実施数のみ件数入れる、記録・代行入力等はそれぞれの項目に入れる"},  # 13
            "14":{"task": "カンファレンス","info":"病棟担当者カンファレンス・各病棟で行っているミーティング・カンファレンスも対象"},  # 14
            "15":{"task": "問い合わせ業務","info":"すべての人からの問い合わせの応対の件数と時間を対象。問い合わせをする方・受ける方の両方を含む。他施設への問い合わせなどの対応（保健調剤薬局以外）を含む"},  # 15
            "16":{"task": "委員会","info":""},  # 16
            "17":{"task": "勉強会参加","info":""},  # 17
            "18":{"task": "WG活動","info":""},  # 18
            "19":{"task": "1on1","info":""},  # 19
            "20":{"task": "ICT","info":""},  # 20
            "21":{"task": "AST","info":""},  # 21
            "22":{"task": "抗菌薬相談対応","info":""},  # 22
            "23":{"task": "褥瘡","info":""},  # 23
            "24":{"task": "TPN評価","info":""},  # 24
            "25":{"task": "手術後使用薬剤確認","info":""},  # 25
            "26":{"task": "手術使用薬剤準備","info":""},  # 26
            "27":{"task": "周術期薬剤管理記録作成","info":"前日分の記録入力"},  # 27
            "28":{"task": "周術期薬剤管理準備","info":"周術期薬剤管理一覧の確認・登録"},  # 28
            "29":{"task": "麻酔科周術期外来予約確認","info":"翌日の外来予約確認"},  # 29
            "30":{"task": "麻酔科周術期外来情報収集","info":"外来前の情報収集"},  # 30
            "31":{"task": "麻酔科周術期外来","info":""},  # 31
            "32":{"task": "麻酔科周術期外来記録","info":"外来後の記録"},  # 32
            "33":{"task": "手術使用麻薬確認・補充","info":""},  # 33
            "34":{"task": "APSチーム回診情報収集","info":"回診前の情報収集"},  # 34
            "35":{"task": "APSチーム回診","info":""},  # 35
            "36":{"task": "APS関連記録作成","info":"APS回診時の記録、当日・翌日以降のAPS対象患者の記録"},  # 36
            "37":{"task": "脳卒中ホットライン対応","info":""},  # 37
            "38":{"task": "手術使用薬剤確認・補充","info":"麻薬以外、血液製剤などの補充"},  # 38
            "39":{"task": "注射薬調製","info":"ベクルリーなどの点滴調製（無菌調製以外）"},  # 39
            "40":{"task": "金庫管理定数確認","info":"HR,救命初療室、1Eの禁錮管理薬定数確認"},  # 40
            "41":{"task": "業務調整","info":"各フロアで行っている業務調整"},  # 41　業務調整のみに変更
            "42":{"task": "休憩","info":""},  # 42
            "43":{"task": "その他","info":""},  # 43
            "44":{"task": "管理業務","info":""},  # 44
            "45":{"task": "NST","info":""},  # 45
            "46":{"task": "マスター作成・変更","info":""},  # 46
            "47":{"task": "薬剤情報評価","info":""},  # 47
            "48":{"task": "後発品選定","info":""},  # 48
            "49":{"task": "会議資料作成","info":""},  # 49
            "50":{"task": "配信資料作成","info":""},  # 50
            "51":{"task": "フォーミュラリー作成","info":""},  # 51
            "52":{"task": "外来処方箋修正","info":""},  # 52
            "53":{"task": "勉強会資料作成・開催","info":""},  # 53
            "54":{"task": "お役立ち情報作成","info":""},  # 54        
            "55":{"task": "薬剤使用期限確認","info":""},  # 55
            "56":{"task": "緩和回診","info":""},  # 56
            "57":{"task": "心不全回診","info":""},  # 57
            "58":{"task": "緩和回診記録作成","info":""},  # 58
            "59":{"task": "手術室サテライト薬剤定数確認","info":""},  # 59
            "60":{"task": "ICTリンクスタッフ活動","info":""},  # 60
            "61":{"task": "医療安全対策WG活動","info":""},  # 61
            "62":{"task": "実習生対応","info":""},  # 62
            "63":{"task": "薬剤部連絡会","info":""},  # 63
        }
    def count_dict(self):
        return {}
    
    def locations():
        return{
            "ICU": "ICU",
            "OR":"OR",
            "HR":"HR",
            "1E":"1E",
            "3A":"3A",
            "3B":"3B",
            "3C":"3C",
            "CCU":"CCU",
            "4A":"4A",
            "4B":"4B",
            "4C":"4C",
            "4D":"4D",
            "HCU":"HCU",
            "5A":"5A",
            "5B":"5B",
            "5C":"5C",
            "5D":"5D",
            "DI":"DI",


        }